# Data Definition Language(DDL)

**Dr. Pengfei Zhao**

Finance Mathematics Program, 

BNU-HKBU United International College

### What can DDL do?

* Allows the specification of:
* The schema for each relation.
* The domain of values associated with each attribute.
* Integrity constraints (ICs).
* The physical storage structure of each relation on disk.
* The set of indices to be maintained for each relation.
* Security and authorization information for each relation.

### DDL Commands

* Below table summarizes the *DDL* statements.
<img src="../Figures/DB/ddl.png" width = "480" height = "300" alt="图片名称" align=center />

* We only focus on below three most commonly used statements, for detailed introduction of MySQL *DDL* you can refer [here](https://dev.mysql.com/doc/refman/5.7/en/sql-syntax-data-definition.html)

>`CREATE TABLE:` used to create a table.

>`ALTER TABLE:` modifies a table after it was created.

>`DROP TABLE:` removes a table from a database.

#### 1. `CREATE TABLE` Statement

* Things to consider before you create your table are:

    * type of data
    * table name
    * what column(s) will make up the primary key
    * names of the columns

**Syntax**

>```SQL
CREATE TABLE <table name>
( field1 datatype ( NOT NULL ),
  field2 datatype ( NOT NULL )
);
```

* Attributes Data Types

 <img src="../Figures/DB/datatype.png" width = "380" height = "300" alt="图片名称" align=center />

**Example: Create a table in database**

In [3]:
%load_ext sql

try:
    import pymysql
    pymysql.install_as_MySQLdb()
except ImportError:
    pass

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

* Let us connect to a database in remote server through below code.
    * `few` (short for "financial engineering workshop") is user account name
    * `123456` is account password
    * `www.uicquant.com` is server name
    * `stocks` is database name

In [4]:
%sql mysql://few:123456@localhost/HelloDB

'Connected: few@HelloDB'

* Show tables (relations) in database

In [5]:
%sql show tables;

3 rows affected.

[('company_info',), ('hundred_stocks_twoyears_daily_bar',), ('sh50',)]

In [7]:
%sql \
CREATE TABLE \
    daily_bar ( \
        code VARCHAR(10), lala DATE, \
        high double, \
        close double, \
        low double, \
        volume double \
    );

0 rows affected.

[]

In [8]:
%sql show tables;

4 rows affected.

[('company_info',),
 ('daily_bar',),
 ('hundred_stocks_twoyears_daily_bar',),
 ('sh50',)]

In [9]:
%sql drop table company_info;

0 rows affected.

[]

In [10]:
%sql \
CREATE TABLE \
    company_info ( \
        code bigint(20), \
        name text, \
        industry text, \
        area text, \
        pe double, \
        pb double, \
        totalAssets double \
    );

0 rows affected.

[]

In [11]:
%sql show tables;

4 rows affected.

[('company_info',),
 ('daily_bar',),
 ('hundred_stocks_twoyears_daily_bar',),
 ('sh50',)]

#### 2. `ALTER TABLE` Statement

* The *ALTER TABLE* statement is used to **add**, **delete**, or **modify** columns in an existing table.

* The *ALTER TABLE* statement is also used to add and drop various **constraints** (to be introduced soon) on an existing table.

**Syntax**

> **ADD Column:**
```SQL
 ALTER TABLE table_name ADD column_name datatype;
```
**Drop Column:**
```SQL
 ALTER TABLE table_name DROP column_name;
```
**Modify Column:**
```SQL
 ALTER TABLE table_name MODIFY COLUMN column_name datatype;
```
>

**Example**

In [12]:
%sql describe HelloDB.daily_bar

6 rows affected.

[('code', 'varchar(10)', 'YES', '', None, ''),
 ('lala', 'date', 'YES', '', None, ''),
 ('high', 'double', 'YES', '', None, ''),
 ('close', 'double', 'YES', '', None, ''),
 ('low', 'double', 'YES', '', None, ''),
 ('volume', 'double', 'YES', '', None, '')]

* Drop a column 'volume'

In [13]:
%sql alter table daily_bar drop volume
%sql describe HelloDB.daily_bar

0 rows affected.
5 rows affected.

[('code', 'varchar(10)', 'YES', '', None, ''),
 ('lala', 'date', 'YES', '', None, ''),
 ('high', 'double', 'YES', '', None, ''),
 ('close', 'double', 'YES', '', None, ''),
 ('low', 'double', 'YES', '', None, '')]

* Add a column

In [14]:
%sql alter table daily_bar add volume double
%sql describe HelloDB.daily_bar

0 rows affected.
6 rows affected.

[('code', 'varchar(10)', 'YES', '', None, ''),
 ('lala', 'date', 'YES', '', None, ''),
 ('high', 'double', 'YES', '', None, ''),
 ('close', 'double', 'YES', '', None, ''),
 ('low', 'double', 'YES', '', None, ''),
 ('volume', 'double', 'YES', '', None, '')]

* Modify a column

In [15]:
%sql alter table daily_bar modify column volume int
%sql describe HelloDB.daily_bar

0 rows affected.
6 rows affected.

[('code', 'varchar(10)', 'YES', '', None, ''),
 ('lala', 'date', 'YES', '', None, ''),
 ('high', 'double', 'YES', '', None, ''),
 ('close', 'double', 'YES', '', None, ''),
 ('low', 'double', 'YES', '', None, ''),
 ('volume', 'int(11)', 'YES', '', None, '')]

In [16]:
%sql alter table daily_bar modify column volume double
%sql describe HelloDB.daily_bar

0 rows affected.
6 rows affected.

[('code', 'varchar(10)', 'YES', '', None, ''),
 ('lala', 'date', 'YES', '', None, ''),
 ('high', 'double', 'YES', '', None, ''),
 ('close', 'double', 'YES', '', None, ''),
 ('low', 'double', 'YES', '', None, ''),
 ('volume', 'double', 'YES', '', None, '')]

#### 3. `Drop Table` statement

**Syntax**

>```SQL
DROP TABLE table_name;
```